package bg.tu_varna.sit.f24621672.projectT3.cli;

/**
 * Поведенчески интерфейс, представляващ единична изпълнима команда в приложението.
 */
public interface Command {
    /**
     * Изпълнява специфичната логика на съответната команда.
     *
     * @param context текущото работно състояние на приложението
     * @param args аргументите, подадени заедно с името на командата
     * @return текстово съобщение, представящо резултата от операцията
     */
    String execute(CommandContext context, String[] args);
}